Tekla Open API Reference for Tekla Structures 2025
BaseWeld.GetWeldGeometries Method
 Method for getting weld seam geometries. Every result represents one individual seam geometry in current weld.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetWeldGeometries()
Public Function GetWeldGeometries As ArrayList
Return Value
Type: ArrayList
An array list that contains weld seam specific WeldGeometry objects.
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace